.emacs.d/early-init.org
#+title: early-init.org
#+description: Kyure_A's Emacs config
#+author: Kyure_A

* Introduction

** Author
Kyure_A

** Repository
https://github.com/Kyure-A/dotfiles/tree/master/.emacs.d

* Configurations
** Header
#+begin_src emacs-lisp
  ;;; early-init.el ---  -*- lexical-binding: t -*-

  ;; Author: Kyure_A <twitter.com/@kyureq>
  ;; Maintainer: Kyure_A <twitter.com/@kyureq>

  ;;; Commentary:

  ;;; Code:
#+end_src

** Suppress auto package loading
#+begin_src emacs-lisp
  (setq package-enable-at-startup nil)
#+end_src

** Disable GC at startup
#+begin_src emacs-lisp
  (setq gc-cons-threshold most-positive-fixnum)
  (add-hook 'emacs-startup-hook (lambda () (setq gc-cons-threshold 536870912)))
#+end_src

** Disable Magit File Name at startup
#+begin_src emacs-lisp
  (defconst init/saved-file-name-handler-alist file-name-handler-alist)
  (setq file-name-handler-alist nil)
  (add-hook 'emacs-startup-hook (lambda () (setq file-name-handler-alist init/saved-file-name-handler-alist)))
#+end_src

** other
#+begin_src emacs-lisp
  (setq inhibit-startup-screen t)
  (setq initial-scratch-message nil)
  (setq inhibit-startup-buffer-menu t)
  (setq message-log-max nil)
  (setq ring-bell-function 'ignore)
#+end_src

** Color Scheme
I love monokai!
#+begin_src emacs-lisp
  (set-face-background 'default "#272822")
#+end_src

** nano-emacs like style
[[https://github.com/rougier/nano-emacs/blob/b8631088220dbbcd885ad1353bdc52b569655f85/nano-layout.el#L21][Source]]
and disable tool-bar and menu-bar.
#+begin_src emacs-lisp
  (setq default-frame-alist
            (append (list
                     '(min-height . 1)
                     '(height     . 45)
                     '(min-width  . 1)
                     '(width      . 81)
                     '(vertical-scroll-bars . nil)
                     '(internal-border-width . 24)
                     '(left-fringe    . 1)
                     '(right-fringe   . 1)
                     '(fullscreen . maximized)
                     '(tool-bar-lines . 0)
                     '(menu-bar-lines . 0))))
#+end_src

** Disable scroll bar
#+begin_src emacs-lisp
  (scroll-bar-mode -1)
#+end_src

** suppress window resize
#+begin_src emacs-lisp
  (setq frame-inhibit-implied-resize t)
#+end_src

** delete other window at window setup
#+begin_src emacs-lisp
  (add-hook 'window-setup-hook 'delete-other-windows)
#+end_src

** Footer
#+begin_src emacs-lisp
  (provide 'early-init)

  ;; End:
  ;;; early-init.el ends here
#+end_src
